MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX170F256B.atdf
      <value-group caption="Oscillator Switch Enable bit" name="OSCCON__OSWEN">
         <value caption="Initiate an oscillator switch to selection specified by NOSC(2:0) bits" name="ON" value="0x1" />
         <value caption="Oscillator switch is complete" name="OFF" value="0x0" />
      </value-group>
      <value-group caption="Secondary Oscillator Enable bit" name="OSCCON__SOSCEN">
         <value caption="Enable Secondary Oscillator" name="ON" value="0x1" />
         <value caption="Disable Secondary Oscillator" name="OFF" value="0x0" />
      </value-group>
      <value-group caption="Clock Fail Detect bit" name="OSCCON__CF">
         <value caption="FSCM has detected a clock failure" name="DET" value="0x1" />
         <value caption="No clock failure has been detected" name="NO_DET" value="0x0" />
      </value-group>
      <value-group caption="Sleep Mode Enable bit" name="OSCCON__SLPEN">
         <value caption="Device will enter Sleep mode when a WAIT instruction is executed" name="ENABLE" value="0x1" />
         <value caption="Device will enter Idle mode when a WAIT instruction is executed" name="DISABLE" value="0x0" />
      </value-group>
      <value-group caption="PLL Lock Status bit" name="OSCCON__SLOCK">
         <value caption="PLL module is in lock or PLL module start-up timer is satisfied" name="IN_LOCK" value="0x1" />
         <value caption="PLL module is out of lock" name="OUT_LOCK" value="0x0" />
      </value-group>
      <value-group caption="Clock Selection Lock Enable bit" name="OSCCON__CLKLOCK">
         <value caption="(If FCKSM(1:0) is 1x) Clock and PLL selections are locked / (If FCKSM(1:0) is 0x) Clock and PLL selections are never locked and may be modified" name="ON" value="0x1" />
         <value caption="(If FCKSM(1:0) is 1x) Clock and PLL selections are not locked and may be modified / (If FCKSM(1:0) is 0x) Clock and PLL selections are never locked and may be modified" name="OFF" value="0x0" />
      </value-group>
      <value-group caption="New Oscillator Selection bits" name="OSCCON__NOSC">
         <value caption="Internal Fast RC Oscillator (FRC) divided by OSCCON(FRCDIV) bits" name="FRCDIV" value="0x7" />
         <value caption="Internal Fast RC Oscillator (FRC) divided by 16" name="FRCDIV16" value="0x6" />
         <value caption="Internal Low-Power RC (LPRC) Oscillator" name="LPRC" value="0x5" />
         <value caption="Secondary Oscillator (SOSC)" name="SOSC" value="0x4" />
         <value caption="Primary Oscillator with PLL module (XTPLL/HSPLL/ECPLL)" name="PRIPLL" value="0x3" />
         <value caption="Primary Oscillator (XT/HS/EC)" name="PRI" value="0x2" />
         <value caption="Internal Fast Internal RC Oscillator with PLL module via Postscaler (FRCPLL)" name="FRCPLL" value="0x1" />
         <value caption="Internal Fast Internal RC Oscillator (FRC)" name="FRC" value="0x0" />
      </value-group>
      <value-group caption="Current Oscillator Selection bits" name="OSCCON__COSC">
         <value caption="Internal Fast RC (FRC) Oscillator divided by OSCCON(FRCDIV) bits" name="FRCDIV" value="0x7" />
         <value caption="Internal Fast RC (FRC) Oscillator divided by 16" name="FRCDIV16" value="0x6" />
         <value caption="Internal Low-Power RC (LPRC) Oscillator" name="LPRC" value="0x5" />
         <value caption="Secondary Oscillator (SOSC)" name="SOSC" value="0x4" />
         <value caption="Primary Oscillator (POSC) with PLL module (XTPLL/HSPLL/ECPLL)" name="POSC_PLL" value="0x3" />
         <value caption="Primary Oscillator (POSC) (XT/HS/EC)" name="POSC" value="0x2" />
         <value caption="Internal Fast RC Oscillator with PLL module via Postscaler (FRCPLL)" name="FRCPLL" value="0x1" />
         <value caption="Internal Fast RC (FRC) Oscillator" name="FRC" value="0x0" />
      </value-group>
      <value-group caption="Phase-Locked Loop (PLL) Multiplier bits" name="OSCCON__PLLMULT">
         <value caption="Clock is multiplied by 24" name="MUL_24" value="0x7" />
         <value caption="Clock is multiplied by 21" name="MUL_21" value="0x6" />
         <value caption="Clock is multiplied by 20" name="MUL_20" value="0x5" />
         <value caption="Clock is multiplied by 19" name="MUL_19" value="0x4" />
         <value caption="Clock is multiplied by 18" name="MUL_18" value="0x3" />
         <value caption="Clock is multiplied by 17" name="MUL_17" value="0x2" />
         <value caption="Clock is multiplied by 16" name="MUL_16" value="0x1" />
         <value caption="Clock is multiplied by 15" name="MUL_15" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Bus Clock (PBCLK) Divisor bits" name="OSCCON__PBDIV">
         <value caption="PBCLK is SYSCLK divided by 8 (default)" name="DIV_8" value="0x3" />
         <value caption="PBCLK is SYSCLK divided by 4" name="DIV_4" value="0x2" />
         <value caption="PBCLK is SYSCLK divided by 2" name="DIV_2" value="0x1" />
         <value caption="PBCLK is SYSCLK divided by 1" name="DIV_1" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Bus Clock Divisor Ready bit" name="OSCCON__PBDIVRDY">
         <value caption="PBDIV(1:0) bits can be written" name="READY" value="0x1" />
         <value caption="PBDIV(1:0) bits cannot be written" name="NOT_READY" value="0x0" />
      </value-group>
      <value-group caption="Secondary Oscillator (SOSC) Ready Indicator bit" name="OSCCON__SOSCRDY">
         <value caption="Indicates that the Secondary Oscillator is running and is stable" name="READY" value="0x1" />
         <value caption="Secondary Oscillator is still warming up or is turned off" name="NOT_READY" value="0x0" />
      </value-group>
      <value-group caption="Internal Fast RC Oscillator Clock Divider bits" name="OSCCON__FRCDIV">
         <value caption="FRC divided by 256" name="DIV256" value="0x7" />
         <value caption="FRC divided by 64" name="DIV64" value="0x6" />
         <value caption="FRC divided by 32" name="DIV32" value="0x5" />
         <value caption="FRC divided by 16" name="DIV16" value="0x4" />
         <value caption="FRC divided by 8" name="DIV8" value="0x3" />
         <value caption="FRC divided by 4" name="DIV4" value="0x2" />
         <value caption="FRC divided by 2 (default setting)" name="DIV2" value="0x1" />
         <value caption="FRC divided by 1" name="DIV1" value="0x0" />
      </value-group>
      <value-group caption="Output Divider for PLL" name="OSCCON__PLLODIV">
         <value caption="PLL output divided by 256" name="DIV_256" value="0x7" />
         <value caption="PLL output divided by 64" name="DIV_64" value="0x6" />
         <value caption="PLL output divided by 32" name="DIV_32" value="0x5" />
         <value caption="PLL output divided by 16" name="DIV_16" value="0x4" />
         <value caption="PLL output divided by 8" name="DIV_8" value="0x3" />
         <value caption="PLL output divided by 4" name="DIV_4" value="0x2" />
         <value caption="PLL output divided by 2" name="DIV_2" value="0x1" />
         <value caption="PLL output divided by 1" name="DIV_1" value="0x0" />
      </value-group>
      <value-group caption="FRC Oscillator Tuning bits" name="OSCTUN__TUN">
         <value caption="Center frequency - 12.5%" name="FREQ_MIN" value="0x20" />
         <value caption="Center frequency. Oscillator runs at minimal frequency (8 MHz)" name="FREQ_CENTER" value="0x0" />
         <value caption="Center frequency + 12.5%" name="FREQ_MAX" value="0x1f" />
      </value-group>
      <value-group caption="Reference Clock Source Select bits" name="REFOCON__ROSEL">
         <value caption="Reserved; do not use" name="" value="0xf" />
         <value caption="Reserved; do not use" name="" value="0xe" />
         <value caption="Reserved; do not use" name="" value="0xd" />
         <value caption="Reserved; do not use" name="" value="0xc" />
         <value caption="Reserved; do not use" name="" value="0xb" />
         <value caption="Reserved; do not use" name="" value="0xa" />
         <value caption="Reserved; do not use" name="" value="0x9" />
         <value caption="REFCLKI" name="REFCLKI" value="0x8" />
         <value caption="Fvco Output" name="Fvco" value="0x7" />
         <value caption="SOSC" name="SOSC" value="0x5" />
         <value caption="LPRC" name="LPRC" value="0x4" />
         <value caption="FRC" name="FRC" value="0x3" />
         <value caption="POSC" name="POSC" value="0x2" />
         <value caption="PBCLK" name="PBCLK" value="0x1" />
         <value caption="SYSCLK" name="SYSCLK" value="0x0" />
      </value-group>
